# CreateBinary Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..CreateBinary Method
IFCData Class See Also
---
Creates a binary data object.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static IFCData CreateBinary(
	string value
)
```

Visual Basic
---
```text
Public Shared Function CreateBinary ( _
	value As String _
) As IFCData
```

Visual C++
---
```text
public:
static IFCData^ CreateBinary(
	String^ value
)
```

# ### Parameters
value
    Type: System..::..String The string value.
# ### Return Value
The IFCData object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace